/*
Αυτός ο κωδικός σχεδιάστηκε από τον Κωνσταντίνο Σάκκα στις 7 Αυγούστου 2020.
Προορίζεται για ακαδημαϊκή χρήση στο Τμήμα Πληροφορικής και Τηλεπικοινωνιών του Πανεπιστημίου
Ιωαννίνων και του github https://ksakkas.github.io/Microcontroller-MSP430/.
*/
/*
Αυτός ο κωδικός σχεδιάστηκε και εκτελέστηκε στο Energia ver. 1.8.11E23
Σχεδιάστηκε για χρήση με TI MSP430F5529
*/

//Αναβοσβήνει κόκκινο και πράσινο led κάθε ένα δευτερόλεπτο

#define RLED RED_LED      //Αρχικοποίηση RLED = red led
#define GLED GREEN_LED   //Αρχικοποίηση GLED = green led

void setup() {                //Συνάρτηση αρχικοποίησης παραμέτρων και υλικών συστήματος.
                             //Αρχικοποιήση σειριακής θύρας: 
  Serial.begin(9600);       //Είναι ο ρυθμός μετάδοσης σε bits ανά δευτερόλεπτο (για Serial).
  pinMode(RLED, OUTPUT);   //Δηλώση RED_LED ως έξοδο 
  pinMode(GLED, OUTPUT);  //Δηλώση GREEN_LED ως έξοδο   

}

int x=0;               //Αρχικοποίηση x = 0 (για μετρητή)
void loop() {
  digitalWrite(RLED, HIGH);    //Δίνει λογική τιμή 1 (HIGH) στο led, δηλαδή το ανάβει.
  digitalWrite(GLED, LOW);    //Δίνει λογική τιμή 0 (LOW) στο led, δηλαδή το απενεργοποιεί.
  delay(1000);               //Καθυστέρηση για 1000 ms = 1 δευτερόλεπτο
  digitalWrite(RLED, LOW);      //Δίνει λογική τιμή 0 (LOW) στο led, δηλαδή το απενεργοποιεί.
  digitalWrite(GLED, HIGH);    //Δίνει λογική τιμή 1 (HIGH) στο led, δηλαδή το ανάβει.
  delay(1000);                //Καθυστέρηση για 1000 ms = 1 δευτερόλεπτο
  x++;                       // x = x + 1
  Serial.print(x);          //εμφάνιση στο σειριακό την τιμή του x
}