/*
Αυτός ο κωδικός σχεδιάστηκε από τον Κωνσταντίνο Σάκκα στις 7 Αυγούστου 2020.
Προορίζεται για ακαδημαϊκή χρήση στο Τμήμα Πληροφορικής και Τηλεπικοινωνιών του Πανεπιστημίου
Ιωαννίνων και του github https://ksakkas.github.io/Microcontroller-MSP430/.
*/
/*
Αυτός ο κωδικός σχεδιάστηκε και εκτελέστηκε στο Energia ver. 1.8.11E23
Σχεδιάστηκε για χρήση με TI MSP430F5529
*/

//Γειά σου Κόσμε

void setup() {        //Συνάρτηση αρχικοποίησης παραμέτρων και υλικών συστήματος.
                     //Αρχικοποιήση σειριακής θύρας: 
Serial.begin(9600); //Είναι ο ρυθμός μετάδοσης σε bits ανά δευτερόλεπτο (για Serial).
}

void loop() {    //Κύρια επαναλαμβανόμενη συνάρτηση
Serial.print("Γειά σου Κόσμε");  //Εμφάνιση μηνύματος στην σειριακή
}