/*
Αυτός ο κωδικός σχεδιάστηκε από τον Κωνσταντίνο Σάκκα στις 7 Αυγούστου 2020.
Προορίζεται για ακαδημαϊκή χρήση στο Τμήμα Πληροφορικής και Τηλεπικοινωνιών του Πανεπιστημίου
Ιωαννίνων και του github https://ksakkas.github.io/Microcontroller-MSP430/.
*/
/*
Αυτός ο κωδικός σχεδιάστηκε και εκτελέστηκε στο Energia ver. 1.8.11E23
Σχεδιάστηκε για χρήση με TI MSP430F5529
*/

//While

#define rled RED_LED      //Αρχικοποίηση RLED =  rled

void setup() {
    Serial.begin(9600);                    //Είναι ο ρυθμός μετάδοσης σε bits ανά δευτερόλεπτο (για Serial).
    pinMode(rled, OUTPUT);                //Δηλώση rled ως έξοδο
}

void loop() {
  int x = Serial.parseInt();        //Διαβάζει από το σειριακό και το μετατρέπει σε ακέραιο

    while(x == 1){                 //Όσο το x = 1
      digitalWrite(rled, HIGH);   //Δίνει λογική τιμή 1 (HIGH) στο led, δηλαδή το ανάβει.
    }
}